<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous">
    <link rel="stylesheet" href="style-history.css">  
    <title>ประวัติและค่านิยมองค์กร</title>
</head>
<body>
    <?php 
        include("navbar.php")
    ?>
    <div class="container" >
        <div class="row justify-content-center pe-5 me-5" style="height: 740vh;z-index:-1;" >
            <div class="col-1 "style="background:red" > 
            </div>    
        </div>
        <div class="row justify-content-center pe-5 me-5" style="height: 20vh;z-index:-1;" >
            <div class="col-2 rounded-circle "style="background:red" > 
                    
            </div>    
        </div>
        
        
    </div>
    <div class="container position-absolute top-0 start-0 pt-5 mt-5">
        <div class="row">
            <div class="col-6 d-flex flex-row-reverse">
                <h1 class="test-history">Integrity
                <p class="d-flex flex-row-reverse">ความซื่อสัตย์</p>
                </h1>
            </div>
            <div class="col-5 ps-5 ms-3">
                <h5>ยุคที่ 1 : กอปรการสื่อสารแห่งราชธานี</h5>
    
                <p class="p-history"><img src="img/history-1.jpg" alt=""><br>จุดเริ่มต้นของการสื่อสารในสมัยก่อนนั้น <br>เกิดจากการสร้างเส้นทางคมนาคมและเส้นทางการค้า<br> โดยมีการติดต่อข่าวสารกันอย่างง่าย ทั้งผ่านทางพ่อค้า ใช้ม้าเร็ว จนถึงการจัดตั้งคนเร็วไว้ตามเมืองสำคัญ <br>ก็ถือเป็นพัฒนาการทางการส่งข่าวสารอย่างง่ายอีกช่องทางหนึ่งและเป็นเช่นนี้เรื่อยมาจนถึงยุคสมัยรัตนโกสินทร์ตอนต้น
    จนมาถึงรัชสมัยของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว พระมหากษัตริย์ไทยพระองค์แรก ที่สนพระทัยในการเขียนจดหมายโต้ตอบเป็นภาษาอังกฤษ และทรงใช้ การไปรษณีย์ในการติดต่อกับประมุขและบุคคลทั้งภายในและภายนอกประเทศ นับเป็นกุศโลบายอันเฉียบแหลมในการเจริญสัมพันธไมตรีกับมิตรประเทศ
    จนสามารถนำรัฐนาวาสยามฝ่าฟันวิกฤต ไม่ตกเป็นเมืองขึ้นของเหล่าประเทศมหาอำนาจในสมัยนั้น
    ด้วยเหตุนี้ "กิจการไปรษณีย์ไทย" จึงถือกำเนิดในรูปแบบต่างๆ การจัดทำตั๋วแสตมป์สำหรับการส่งหนังสือพิมพ์รายวันภาษาไทยครั้งแรก ซึ่งถือเป็นการเริ่มต้นกิจการไปรษณีย์ภายในกรุงเทพฯ นับแต่นั้นเป็นต้นมา
    ด้วยความสำคัญ และประโยชน์ของการส่งข่าวสารนี้เอง ที่ทำให้รัฐบาลสยาม เตรียมการจัดตั้งกิจการไปรษณีย์ในกรุงเทพฯ นับเป็นการเข้าสู่ยุคของการไปรษณีย์อย่างแท้จริง</p>
            </div>
        </div>
        <div class="row">
            <div class="col-6 d-flex flex-row-reverse">
                <h1 class="test-history pt-5">Service Mind
                <p class="d-flex flex-row-reverse">มีใจรักในการให้บริการ</p>
                </h1>
            </div>
            <div class="col-5 ps-5 ms-3 pt-5">
                <h5>ยุคที่ 2 : สืบศักดิ์ศิวิไลซ์ในสากล</h5>
    
                <p class="p-history"><img src="img/history-2.jpg" alt=""><br> ในรัชสมัยของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว ถือเป็นยุคแรกของ การไปรษณีย์ไทย ด้วยการจัดตั้งกรมไปรษณีย์ในประเทศไทย และการผลิต "แสตมป์ชุดโสฬส" แสตมป์ชุดแรกของประเทศ รวมไปถึงจัดพิมพ์ไปรษณียบัตรครั้งแรก เพื่อรองรับกิจการไปรษณีย์ที่เกิดขึ้นในขณะนั้นอีกด้วย
    กิจการไปรษณีย์ของคนไทยในยุคสมัยนั้น มีความมุ่งมั่นที่จะพัฒนาให้ดียิ่งขึ้นอยู่เสมอ จึงได้ดำเนินการจัดทำโครงการต่างๆ เพื่องานไปรษณีย์ในทุกด้าน ทั้งการเข้าร่วมกับกลุ่มสหภาพสากลไปรษณีย์ เพื่อให้สามารถขนส่งและแลกเปลี่ยนไปรษณียภัณฑ์กับต่างประเทศได้
    และเพื่อจัดเตรียมบุคลากรเข้าศึกษาและฝึกงานด้านไปรษณีย์สำหรับเข้าทำงานในกรมไปรษณีย์อย่างมีประสิทธิภาพ ในเวลาต่อมาได้จัดตั้งโรงเรียนไปรษณีย์และคมนาคมขึ้น รวมไปถึงการขยายกิจการไปรษณีย์ ด้วยการจัดสร้างที่ทำการไปรษณีย์แห่งที่ 2 อีกด้วย
    แม้ว่าเกิดเหตุการณ์ร้ายแรงใดๆ ก็ตาม กรมไปรษณีย์ก็ไม่หยุดให้บริการแก่ประชาชน เพราะเล็งเห็นถึงความสำคัญของการติดต่อสื่อสาร เช่นเดียวกับช่วงสงครามโลกครั้งที่ 2 กรมไปรษณีย์โทรเลขก็ไม่เคยหยุดทำการเช่นกัน </p>
            </div>
        </div>
        <div class="row">
            <div class="col-6 d-flex flex-row-reverse">
                <h1 class="test-history pt-5">Unity
                <p class="d-flex flex-row-reverse">ความรักองค์กร </p>
                </h1>
            </div>
            <div class="col-5 ps-5 ms-3 pt-5">
                <h5>ยุคที่ 3 : อภิวัฒนาการไปรษณีย์ไทย</h5>
    
                <p class="p-history"><img src="img/history-3.jpg" alt=""><br>  จากการมีส่วนร่วมในการประชุมองค์การสากลระหว่างประเทศหลายครั้ง ทำให้มีการปรับเปลี่ยนงานด้านองค์กรและด้านบริการอย่างต่อเนื่อง โดยกระทรวงโยธาธิการ ประกาศให้รวมกรมไปรษณีย์และกรมโทรเลขเข้าด้วยกัน เรียกว่า "กรมไปรษณีย์โทรเลข" เพื่อให้การบริหารราชการดำเนินไปอย่างสะดวกขึ้น
    การพัฒนางานไปรษณีย์ในยุคนั้น อยู่ภายใต้การควบคุมของกระทรวงโยธาธิการ ซึ่งได้ดำเนินการทำหนังสือสัญญาเส้นขนส่งถุงไปรษณีย์ครอบคลุมทุกเส้นทางคมนาคม เป็น การรองรับความสะดวก และรวดเร็วของการส่งไปรษณียภัณฑ์ได้อย่างทั่วถึง
    กิจการสื่อสารไทยนั้น ได้รับการพัฒนาและขยายบริการให้ครอบคลุมอย่างไม่หยุดยั้งและกว้างขวางมากที่สุดในช่วงรัชสมัยพระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว เริ่มจากการเปิดที่ทำการไปรษณีย์โทรเลขครบ 18 มณฆลทั่วประเทศ การใช้รถยนต์ขนส่งไปรษณียภัณฑ์ และการเปิดเส้นทางขนส่งไปรษณียภัณฑ์ทางอากาศในประเทศ
    เนื่องจากกิจการของกรมไปรษณีย์โทรเลขในช่วงนั้นได้ขยายงานอย่างรวดเร็ว ทำให้ต้องย้ายจากตึกไปรสนียาคารมารวมกับที่ทำการไปรษณีย์แห่งที่ 2 และได้เปลี่ยนชื่อเป็น "ที่ทำการไปรษณีย์กลาง" ดังปรากฏจนถึงปัจจุบัน เมื่อเข้าสู่รอยต่อครั้งสำคัญที่สุดในประวัติศาสตร์การเมืองปกครองระดับประเทศจากระบอบสมบูรณาญาสิทธิราชมาเป็นระบอบประชาธิปไตยนั้นกรมไปรษณีย์โทรเลขต้องเผชิญกับความเปลี่ยนแปลงอีกหลายครั้ง โดยเฉพาะการแก้ไขปรับปรุงและตรากฎหมายขึ้นมาบังคับใช้หลายฉบับ รวมไปถึงการจัดส่วนราชการตามพระราชกฤษฎีกา เพื่อแยกงานด้านต่างๆ ที่เคยอยู่ภายใต้กรมไปรษณีย์โทรเลข มาจัดตั้งเป็นหน่วยงานเอกเทศ
    ความพยายามที่จะปรับปรุงกิจการ ให้มีความคล่องตัว ในระบบการบริหาร เพื่อให้เกิดการบริการที่มีประสิทธิภาพ จนเกิดการพลิกโฉมหน้าประวัติศาสตร์ครั้งสำคัญของกรมไปรษณีย์โทรเลข เมื่อมีประกาศใช้พระราชบัญญัติการสื่อสารแห่งประเทศไทย พ.ศ. 2519 เพื่อแยกงานระดับปฏิบัติการออกไป และจัดตั้งเป็นรัฐวิสาหกิจ นับเป็นจุดเริ่มต้นของการเป็นรัฐวิสาหกิจตั้งแต่นั้นเป็นต้นมา</p>
            </div>
        </div>
        <div class="col-12 d-flex justify-content-center">
                <h1 class="test-history pt-5">Result Orientation
                <p class="d-flex justify-content-center">การทำงานโดยมุ่งเน้นผลสำเร็จ</p>
                </h1>
        </div>
        <div class="row">
            <div class="col-6 text-end pe-5 ps-4">
                <h5><br>ยุคที่ 4 : ธำรงพันธกิจเพื่อประชา</h5>
    
                <p class="p-history">การดำเนินงานในรูปแบบรัฐวิสาหกิจภายใต้ชื่อ "การสื่อสารแห่งประเทศไทย" ยังคงสืบสานเจตนารมณ์ที่จะทำให้การติดต่อสื่อสารทั้งไปรษณีย์และโทรคมนาคมของไทย มีความเจริญพัฒนาก้าวไกล มีส่วนเสริมสร้างเศรษฐกิจและวิถีชีวิตของคนไทย โดยกรมไปรษณีย์โทรเลขยังคงมีสถานะเป็นหน่วยงานราชการที่ทำหน้าที่ด้านนโยบาย และบริหารคลื่นความถี่วิทยุเช่นเดิม
    ติดต่อสื่อสารทั้งไปรษณีย์และโทรคมนาคมของไทย มีความเจริญพัฒนาก้าวไกล มีส่วนเสริมสร้างเศรษฐกิจและวิถีชีวิตของคนไทย โดยกรมไปรษณีย์โทรเลขยังคงมีสถานะเป็นหน่วยงานราชการที่ทำหน้าที่ด้านนโยบาย และบริหารคลื่นความถี่วิทยุเช่นเดิม
    ตลอดระยะเวลา 25 ปี ของการสื่อสารแห่งประเทศไทย ภายใต้สังกัดกระทรวงคมนาคม กสท. ไม่เคยหยุดนิ่งต่อการพัฒนาความก้าวหน้าทางเทคโนโลยี สร้างระบบเชื่อมโยงเครือข่าย พัฒนาคุณภาพบริการสื่อสารทั้งด้านไปรษณีย์และโทรคมนาคม ดังคำขวัญที่ว่า "เครือข่ายทั่วไทย โยงใยทั่วโลก" และเพื่อรองรับความก้าวหน้าที่พัฒนาอย่างไม่หยุดยั้ง จึงเกิดอาคารสำนักงานใหญ่ที่ ถนนแจ้งวัฒนะ หลักสี่ นับตั้งแต่ปี พ.ศ. 2529
    วันนี้กิจการไปรษณีย์ได้ก้าวมาถึงจุดเปลี่ยนที่สำคัญอีกช่วงหนึ่งคือการแปลงสภาพการสื่อสารแห่งประเทศไทย มาจัดตั้งเป็นบริษัท ไปรษณีย์ไทย จำกัด และ บริษัท กสท. โทรคมนาคม จำกัด (มหาชน) เป็นองค์กรรัฐวิสาหกิจภายใต้กระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร เมื่อวันที่ 14 สิงหาคม พ.ศ. 2546
    นับเป็นจุดเปลี่ยนที่สำคัญของประวัติศาสตร์การไปรษณีย์อีกครั้งหนึ่ง ที่แสดงให้เห็นถึงศักยภาพของพนักงานที่พร้อมรับการเปลี่ยนแปลง และร่วมมือกันอย่างเต็มกำลังความสามารถ เพื่อการปฏิรูปกิจการไปรษณีย์ นำสู่บริการที่ตอบสนองทุกความต้องการของประชาชน เพื่อการเติบโตอย่างยั่งยืน มีรายได้ที่เลี้ยงตัวเองเองได้ตลอดไป</p>
            </div>
            <div class="col-5 ps-5 ms-3 pt-5 mt-4" >
                <img src="img/history-4.jpg" alt=""style="height:600px">
            </div>
        </div>
        <div class="row">
       
            <div class="col-6 text-end pe-5 ps-4">
                <h5><br>ยุคที่ 5 : ดำเนินวัฒนาเพื่อปวงชน</h5>

                <p class="p-history"><img src="img/history-5.jpg" alt=""><br>    ปัจจุบัน บริษัท ไปรษณีย์ไทย จำกัด มุ่งมั่นในการเป็นผู้นำธุรกิจไปรษณีย์และให้บริการที่มีประสิทธิภาพ เพื่อตอบสนองทุกความต้องการของธุรกิจและคนไทยในทุกระดับ ทุกพื้นที่ ด้วยศักยภาพของเครือข่ายที่ทำการไปรษณีย์กว่า 1,200 แห่ง และศูนย์ไปรษณีย์ 13 แห่ง ทั้งในกรุงเทพฯ และภูมิภาค พร้อมด้วยบุคลากรที่ชำนาญงาน ตลอดจนเครื่องมืออันทันสมัย และ การพัฒนาที่ไม่หยุดนิ่ง เพื่อเชื่อมโยงเข้ากับเครือข่ายไปรษณีย์ทั่วทุกมุมโลก
            กิจการไปรษณีย์จึงพร้อมเป็นผู้เชื่อมโยงที่ดีที่สุด ด้วยบริการที่มีคุณภาพ ตอบสนองทุกความต้องการได้อย่างตรงจุด</p>
            </div>
            <div class="col-12 d-flex justify-content-center">
                <h1 class="test-history pt-5">Change Capability 
                <p class="d-flex justify-content-center">ความพร้อมต่อการเปลี่ยนแปลง</p>
                </h1>
            </div>
       </div>
       <div class="row d-flex justify-content-center">
            <div class="col-7 text-center  " style="padding-top:80px">
                <h1 class="pt-5 mt-5">ลำดับเหตุการณ์ "ตั้งแต่ปี พ.ศ. 2423 ถึง ปัจจุบัน"</h1>
    
                <p class="p-history pt-3"><img src="img/history-6.jpg" alt=""><br> ใน ปี พ.ศ. 2423 เจ้าหมื่นเสมอใจราช หัวหมื่นมหาดเล็กเวรสิทธิ์ ได้ทำหนังสือกราบบังคมทูล พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว ถวายคำแนะนำให้เปิดบริการไปรษณีย์ขึ้นใน ประเทศไทย โดยพระบาทสมเด็จพระจุลจอมเกล้า เจ้าอยู่หัว ทรงมีพระราชดำริเห็นชอบ จึงทรงแต่งตั้งให้ สมเด็จพระเจ้าน้องยาเธอ เจ้าฟ้าภาณุรังษี สว่างวงศ์กรมหลวงภาณุพันธุวงศ์วรเดช ผู้ทรงมี ประสบการณ์ เกี่ยวกับการจัดส่งหนังสือพิมพ์รายวัน "ข่าวราชการ" ดำรงตำแหน่งผู้สำเร็จราชการกรมไปรษณีย์
    เมื่อสมเด็จพระเจ้าน้องยาเธอเจ้าฟ้า ภาณุรังษีสว่างวงศ์ฯ ได้ทรงวางโครงการและ เตรียมการไว้พร้อมที่จะ เปิดบริการไปรษณีย์ ได้แล้ว ก็ได้ประกาศเปิดรับฝาก ส่งจดหมายหรือหนังสือ เป็นการทดลองในเขต พระนครและธนบุรีขึ้นเมื่อ วันที่ 4 สิงหาคม พ.ศ. 2426 มีที่ทำการตั้งอยู่ ณ ตึกใหญ่ริมแม่น้ำเจ้าพระยา ตอนปากคลองโอ่งอ่าง ด้านทิศเหนือ (ปัจจุบันถูกรื้อเพื่อใช้ที่สร้าง สะพานคู่ขนานกับสะพานพุทธ) ที่ทำการแห่งแรกนี้ใช้เป็น ที่ทำการไปรษณีย์สำหรับจังหวัดพระนคร ด้วยเรียกกันว่า "ไปรษณียาคาร"
    ต่อมาในปี พ.ศ. 2441 เสนาบดีกระทรวงโยธาธิการกราบบังคมทูล เสนอความเห็นว่าราชการ ของกรมไปรษณีย์และราชการของกรมโทรเลข ซึ่งตั้งขึ้นก่อนกรมไปรษณีย์แล้วนั้นเป็นงานใน ด้านสื่อสารด้วยกันควรรวมเป็นหน่วยราชการ เดียวกันเสียเพื่อความสะดวกแก่การดำเนินงาน พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวทรงเห็น เป็นสมควรจึงทรงพระกรุณาโปรดเกล้าฯ ให้รวมหน่วยงานทั้งสองเข้าด้วยกันเรียกว่า "กรมไปรษณีย์โทรเลข"
    ต่อมาได้ย้ายไปใช้อาคารและที่ดินริมถนน เจริญกรุงเป็นที่ทำการและเรียกกันโดยทั่วไปว่า "ที่ทำการไปรษณีย์กลาง" การไปรษณีย์ เป็นบริการสาธารณะจำเป็นต้องมีระเบียบข้อบังคับเพื่อให้ประชาชนผู้ใช้บริการและ เจ้าหน้าที่ผู้ดำเนินบริการทราบและถือปฏิบัติเมื่อ เปิดการไปรษณีย์โทรเลขได้ประมาณ 2 ปีแล้ว รัฐบาลจึงได้ตรากฏหมายขึ้นใน ปี พ.ศ. 2428 เรียกว่า "พระราชบัญญัติการไปรษณีย์ไทย จุลศักราช 1248"
    เมื่อวันที่ 25 กุมภาพันธ์ พ.ศ. 2520 ได้มีการจัดตั้ง "การสื่อสารแห่งประเทศไทย (กสท.)" ตามพระราชบัญญัติการสื่อสารแห่งประเทศไทย พ.ศ. 2519 โดยรับมอบกิจการด้านปฏิบัติการทั้งหมด รวมถึงการให้บริการไปรษณีย์จากกรมไปรษณีย์โทรเลขมาดำเนินการ โดยมีสถานะเป็นรัฐวิสาหกิจ ใช้สถานที่ปฏิบัติงาน ณ ที่ทำการไปรษณีย์กลาง ต่อมาสำนักงานใหญ่ย้ายมาอยู่ที่ถนนแจ้งวัฒนะ ซึ่ง กสท. ได้ปรับปรุงและพัฒนาบริการให้เจริญก้าวหน้ามาโดยตลอด จนเป็นรัฐวิสาหกิจชั้นนำที่ยิ่งใหญ่ มีศักยภาพเครือข่าย ระบบ และคุณภาพบริการระดับมาตรฐานสากล
    จากนโยบายรัฐบาลที่ต้องการแปรสภาพรัฐวิสาหกิจ เพื่อเพิ่มประสิทธิภาพการทำงานให้เทียบเท่าภาคเอกชน ซึ่ง กสท. เป็นหนึ่งในรัฐวิสาหกิจที่ต้องดำเนินการตามนโยบายดังกล่าว โดยเมื่อวันที่ 8 กรกฎาคม 2546 คณะรัฐมนตรีมีมติให้แปรสภาพ กสท. ตามแผนแม่บทพัฒนากิจการโทรคมนาคม และพระราชบัญญัติทุนรัฐวิสาหกิจ พ.ศ. 2542 แยกกิจการเป็น 2 บริษัท คือ บริษัท ไปรษณีย์ไทย จำกัด และบริษัท กสท โทรคมนาคม จำกัด (มหาชน) ซึ่งจดทะเบียนจัดตั้งเป็นบริษัทเมื่อวันที่ 14 สิงหาคม 2546</p>
            </div>
        </div>
        
    </div>
    <!-- footer -->
    <div class="footer pt-4" style="background-color:#34374C;height:150px; margin-top: 1000px;">
        <div class="container">
            <div class="row ">
                <div class="col-6">
                    <h5 class="text-light pb-2">ติดตาม</h5>
                </div>
                <div class="col-6 d-flex flex-row-reverse pe-4"> 
                    <h5 class="text-light pb-2">jump</h5>
                </div>
                <div class="col-6 d-flex  pt-2"> 
                    <div class="link-face">
                        <a href="https://m.facebook.com/profile.php?id=107457430816077&__tn__=C-R">
                            <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" fill="#EE2B47" class="bi bi-facebook" viewBox="0 0 16 16">
                            <path d="M16 8.049c0-4.446-3.582-8.05-8-8.05C3.58 0-.002 3.603-.002 8.05c0 4.017 2.926 7.347 6.75 7.951v-5.625h-2.03V8.05H6.75V6.275c0-2.017 1.195-3.131 3.022-3.131.876 0 1.791.157 1.791.157v1.98h-1.009c-.993 0-1.303.621-1.303 1.258v1.51h2.218l-.354 2.326H9.25V16c3.824-.604 6.75-3.934 6.75-7.951z"/>
                            </svg>
                        </a>
                    </div>
                    <div class="link-instr">
                        <a href="https://www.instagram.com/explore/locations/223084014/thailand/bangkok-thailand/">
                            <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" fill="#EE2B47" class="ms-3 bi bi-instagram" viewBox="0 0 16 16">
                            <path d="M8 0C5.829 0 5.556.01 4.703.048 3.85.088 3.269.222 2.76.42a3.917 3.917 0 0 0-1.417.923A3.927 3.927 0 0 0 .42 2.76C.222 3.268.087 3.85.048 4.7.01 5.555 0 5.827 0 8.001c0 2.172.01 2.444.048 3.297.04.852.174 1.433.372 1.942.205.526.478.972.923 1.417.444.445.89.719 1.416.923.51.198 1.09.333 1.942.372C5.555 15.99 5.827 16 8 16s2.444-.01 3.298-.048c.851-.04 1.434-.174 1.943-.372a3.916 3.916 0 0 0 1.416-.923c.445-.445.718-.891.923-1.417.197-.509.332-1.09.372-1.942C15.99 10.445 16 10.173 16 8s-.01-2.445-.048-3.299c-.04-.851-.175-1.433-.372-1.941a3.926 3.926 0 0 0-.923-1.417A3.911 3.911 0 0 0 13.24.42c-.51-.198-1.092-.333-1.943-.372C10.443.01 10.172 0 7.998 0h.003zm-.717 1.442h.718c2.136 0 2.389.007 3.232.046.78.035 1.204.166 1.486.275.373.145.64.319.92.599.28.28.453.546.598.92.11.281.24.705.275 1.485.039.843.047 1.096.047 3.231s-.008 2.389-.047 3.232c-.035.78-.166 1.203-.275 1.485a2.47 2.47 0 0 1-.599.919c-.28.28-.546.453-.92.598-.28.11-.704.24-1.485.276-.843.038-1.096.047-3.232.047s-2.39-.009-3.233-.047c-.78-.036-1.203-.166-1.485-.276a2.478 2.478 0 0 1-.92-.598 2.48 2.48 0 0 1-.6-.92c-.109-.281-.24-.705-.275-1.485-.038-.843-.046-1.096-.046-3.233 0-2.136.008-2.388.046-3.231.036-.78.166-1.204.276-1.486.145-.373.319-.64.599-.92.28-.28.546-.453.92-.598.282-.11.705-.24 1.485-.276.738-.034 1.024-.044 2.515-.045v.002zm4.988 1.328a.96.96 0 1 0 0 1.92.96.96 0 0 0 0-1.92zm-4.27 1.122a4.109 4.109 0 1 0 0 8.217 4.109 4.109 0 0 0 0-8.217zm0 1.441a2.667 2.667 0 1 1 0 5.334 2.667 2.667 0 0 1 0-5.334z"/>
                            </svg>
                        </a>
                    </div>
                    <div class="link-twit">
                        <a href="https://twitter.com/thailand_post">
                            <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" fill="#EE2B47" class="ms-3 bi bi-twitter" viewBox="0 0 16 16">
                            <path d="M5.026 15c6.038 0 9.341-5.003 9.341-9.334 0-.14 0-.282-.006-.422A6.685 6.685 0 0 0 16 3.542a6.658 6.658 0 0 1-1.889.518 3.301 3.301 0 0 0 1.447-1.817 6.533 6.533 0 0 1-2.087.793A3.286 3.286 0 0 0 7.875 6.03a9.325 9.325 0 0 1-6.767-3.429 3.289 3.289 0 0 0 1.018 4.382A3.323 3.323 0 0 1 .64 6.575v.045a3.288 3.288 0 0 0 2.632 3.218 3.203 3.203 0 0 1-.865.115 3.23 3.23 0 0 1-.614-.057 3.283 3.283 0 0 0 3.067 2.277A6.588 6.588 0 0 1 .78 13.58a6.32 6.32 0 0 1-.78-.045A9.344 9.344 0 0 0 5.026 15z"/>
                            </svg>
                        </a>
                    </div>
                    <a href="https://www.google.com/search?gs_ssp=eJzj4tVP1zc0TM8oMDAoT8kzYLRSNagwNjS0NEkxtjBLsTAyTLEwtTKoSDUzSUu0NDMxsjBLMwcKe5k92NnyYMfsBzsWP9ix8sGOyQ92bH2wY9GDnT0PdnQ82LH2wY6FD3aserBjB1jBpgc72h_saAHKAgAbjzaU&q=%E0%B9%84%E0%B8%9B%E0%B8%A3%E0%B8%A9%E0%B8%93%E0%B8%B5%E0%B8%A2%E0%B9%8C%E0%B8%88%E0%B8%AD%E0%B8%A1%E0%B8%AA%E0%B8%B8%E0%B8%A3%E0%B8%B2%E0%B8%87%E0%B8%84%E0%B9%8C&rlz=1C1CHBF_enTH861TH861&oq=%E0%B9%84%E0%B8%9B%E0%B8%A3%E0%B8%A9%E0%B8%93%E0%B8%B5%E0%B8%A2%E0%B9%8C%E0%B8%88%E0%B8%AD&aqs=chrome.1.69i57j46i175i199i512j0i512l2j46i175i199i512l2j0i512j69i61.6954j0j4&sourceid=chrome&ie=UTF-8">
                        <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" fill="#EE2B47" class="ms-3 bi bi-google" viewBox="0 0 16 16">
                        <path d="M15.545 6.558a9.42 9.42 0 0 1 .139 1.626c0 2.434-.87 4.492-2.384 5.885h.002C11.978 15.292 10.158 16 8 16A8 8 0 1 1 8 0a7.689 7.689 0 0 1 5.352 2.082l-2.284 2.284A4.347 4.347 0 0 0 8 3.166c-2.087 0-3.86 1.408-4.492 3.304a4.792 4.792 0 0 0 0 3.063h.003c.635 1.893 2.405 3.301 4.492 3.301 1.078 0 2.004-.276 2.722-.764h-.003a3.702 3.702 0 0 0 1.599-2.431H8v-3.08h7.545z"/>
                        </svg>
                    </a>
                    <a href="https://www.youtube.com/user/thailandpostchannel">
                        <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" fill="#EE2B47" class="ms-3 bi bi-youtube" viewBox="0 0 16 16">
                        <path d="M8.051 1.999h.089c.822.003 4.987.033 6.11.335a2.01 2.01 0 0 1 1.415 1.42c.101.38.172.883.22 1.402l.01.104.022.26.008.104c.065.914.073 1.77.074 1.957v.075c-.001.194-.01 1.108-.082 2.06l-.008.105-.009.104c-.05.572-.124 1.14-.235 1.558a2.007 2.007 0 0 1-1.415 1.42c-1.16.312-5.569.334-6.18.335h-.142c-.309 0-1.587-.006-2.927-.052l-.17-.006-.087-.004-.171-.007-.171-.007c-1.11-.049-2.167-.128-2.654-.26a2.007 2.007 0 0 1-1.415-1.419c-.111-.417-.185-.986-.235-1.558L.09 9.82l-.008-.104A31.4 31.4 0 0 1 0 7.68v-.123c.002-.215.01-.958.064-1.778l.007-.103.003-.052.008-.104.022-.26.01-.104c.048-.519.119-1.023.22-1.402a2.007 2.007 0 0 1 1.415-1.42c.487-.13 1.544-.21 2.654-.26l.17-.007.172-.006.086-.003.171-.007A99.788 99.788 0 0 1 7.858 2h.193zM6.4 5.209v4.818l4.157-2.408L6.4 5.209z"/>
                        </svg>
                    </a>
                    
                </div>
                <div class="col-6 d-flex flex-row-reverse pe-4 " style="">
                        <a href="#top">
                            <svg xmlns="http://www.w3.org/2000/svg" width="50" height="50 " fill="#EE2B47" class="bi bi-file-arrow-up-fill" viewBox="0 0 16 16">
                            <path d="M12 0H4a2 2 0 0 0-2 2v12a2 2 0 0 0 2 2h8a2 2 0 0 0 2-2V2a2 2 0 0 0-2-2zM7.5 6.707 6.354 7.854a.5.5 0 1 1-.708-.708l2-2a.5.5 0 0 1 .708 0l2 2a.5.5 0 0 1-.708.708L8.5 6.707V10.5a.5.5 0 0 1-1 0V6.707z"/>
                            </svg>        
                        </a>  
                </div>
            </div>
        </div>
        
    </div>
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/js/bootstrap.bundle.min.js" integrity="sha384-ka7Sk0Gln4gmtz2MlQnikT1wXgYsOg+OMhuP+IlRH9sENBO0LRn5q+8nbTov4+1p" crossorigin="anonymous"></script>

</body>
</html>